<template>
  <div class="box">
    <waterfallFlow
      :waterInfo="waterInfo"
      :columns="columns"
      :offset="offset"
      :loadsNum="loadsNum"
    >
      <template #flow="flow">
        <!-- 使用者自定义渲染风格 -->
        <div class="itembox">
          <img v-if="flow.itemFlow.img" :src="flow.itemFlow.img" alt="" />
          <p class="wordcolor">{{ flow.itemFlow.content }}</p>
          <img v-if="flow.itemFlow.img2" :src="flow.itemFlow.img2" alt="" />
        </div>
      </template>
    </waterfallFlow>
  </div>
</template>

<script>
import waterfallFlow from "./components/waterfall.vue";
export default {
  name: "App",
  data() {
    return {
      // 数据
      waterInfo: [
        {
          content:
            "世万万种相遇，界，安静品一生有诸多的美好，而我情有独钟的是种相万种相遇，界，安静品一生有诸多的美好，而我情有独钟的是遇，界，安静品一生有诸多的美好，而我情有独钟的是间有千万种相遇，界，安静品一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
          img: require("./assets/1.jpg"),
        },
        {
          content:
            "只是因若如知弦鸣的悲凉，那手指余温可否换一平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        {
          content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。",
          img2: require("./assets/8.jpg"),
        },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
          img: require("./assets/2.jpg"),
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        {
          content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。",
          img2: require("./assets/4.jpg"),
        },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
          img: require("./assets/3.jpg"),
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断9的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "就让我们一直走下去，直到世界一片纯白。",
          img2: require("./assets/5.jpg"),
        },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会长99大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content: "11",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
          img2: require("./assets/6.jpg"),
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content: "见叫做一见倾心，红尘中惊鸿的一瞥，4你便凝眸在我内心深处",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，4你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
          img2: require("./assets/7.jpg"),
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可9知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可9知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
          img: require("./assets/8.jpg"),
        },
        { content: "时光的洪流中556，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
          img2: require("./assets/9.jpg"),
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的2一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣9？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会9长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
          img: require("./assets/10.jpg"),
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我76忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会2长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们8总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总9876会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便9凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会长大。000" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content: "11",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content: "22",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总00会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘65中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的e洪流中，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一9瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会u长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸8在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中f，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content: "11",
        },
        {
          content: "22",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城11池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中8，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的2哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊2鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘65中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的e洪流中，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一9瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总会u长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸8在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中f，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content: "11",
        },
        {
          content: "22",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城11池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        {
          content: "33",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中8，我们总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "和善良对峙的，不一定只是邪恶。可能也是残酷。和理想对峙的，不一定只是世俗。可能也是天真。",
        },
        {
          content:
            "世间有千万种相遇，而有种遇见叫做一见倾心，红尘中惊鸿的一瞥，你便凝眸在我内心深处，而我为这一眼就开始为你步步沦陷，只想有你温暖的陪伴别无它求，弱水三千取一瓢饮，只想独享你的世界，安静品读。守一份承诺细诉着爱恋，步入你温暖的城池，人的一生有诸多的美好，而我情有独钟的是与你相濡以沫。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的2哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们sdg总会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问3前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        {
          content:
            "如果你的征途上有暴风雨，我愿把思念化作细丝，织成一把密密的友谊伞，让我们在暴风雨中走向胜境！",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你1容颜，你可知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
        { content: "时光的洪流中，我们总re会长大。" },
        {
          content:
            "飞机场的骚乱一会儿就停止了，这里的人都是有着自己的方向的，匆匆地起飞，匆匆地下降，带走别人的故事，留下自己的回忆。",
        },
        {
          content:
            "只是因为在人群中多看了你一眼，使我忘不了你容颜，你可8知弦断的哀鸣？为你种情盅爱毒，受尽辗转轮回。你若如知弦鸣的悲凉，那手指余温可否换一世相守，且不问前世转身，且不诉前世别离，任它人间花如雨，平生至爱你一人。默然，相爱。寂静，欢喜。",
        },
        { content: "就让我们一直走下去，直到世界一片纯白。" },
        { content: "我醒了，想看看天上飘着的是，云做的雨还是雪做的云。" },
        {
          content:
            "是谁，卷起秋风那无奈的萧瑟？是谁，在落花的泥土里浸染了无限的深情？是谁，点亮秋雨如针如丝的光芒？在秋雨深处，嗅到了寒凉的味道，让感觉缠绕丝丝缕缕秋的絮语。",
        },
      ],
      columns: 3, // 列数
      offset: 6, // 每个元素之间的间距
      loadsNum: 20, // 每次触底加载数量
    };
  },
  components: {
    waterfallFlow,
  },
};
</script>

<style lang="less" scoped>
.box {
  width: 92vw;
  height: 94vh;
  margin: 0 auto;
  border: 1px solid #aaa;
  border-radius: 5px;
  .itembox {
    text-indent: 2em;
    background-color: #f1f3f4;
    width: 100%;
    height: 100%;
    box-sizing: border-box;
    padding: 10px;
    border-radius: 5px;
    .wordcolor {
      color: #000;
      text-indent: 2em;
      font-size: 16px;
      list-style: none;
      margin: 5px 0;
      padding: 0;
    }
    img {
      width: 100%;
      display: block;
    }
  }
}
</style>